jmeter/report_BS2/statistics.json
{
  "A1 - POST /jobs/search" : {
    "transaction" : "A1 - POST /jobs/search",
    "sampleCount" : 15017,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 81.29067057335051,
    "medianResTime" : 77.0,
    "minResTime" : 1.0,
    "maxResTime" : 338.0,
    "pct1ResTime" : 130.0,
    "pct2ResTime" : 152.0,
    "pct3ResTime" : 201.0,
    "throughput" : 251.99268370446194,
    "receivedKBytesPerSec" : 2414.359272219472,
    "sentKBytesPerSec" : 59.261626785025086
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 63932,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 69.92573359194104,
    "medianResTime" : 69.0,
    "minResTime" : 0.0,
    "maxResTime" : 338.0,
    "pct1ResTime" : 116.0,
    "pct2ResTime" : 133.0,
    "pct3ResTime" : 172.0,
    "throughput" : 1072.810564999245,
    "receivedKBytesPerSec" : 5417.371928120752,
    "sentKBytesPerSec" : 344.4196138283859
  },
  "B2 - POST /jobs/search" : {
    "transaction" : "B2 - POST /jobs/search",
    "sampleCount" : 16948,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 85.30062544253013,
    "medianResTime" : 81.0,
    "minResTime" : 1.0,
    "maxResTime" : 297.0,
    "pct1ResTime" : 133.0,
    "pct2ResTime" : 154.0,
    "pct3ResTime" : 204.0,
    "throughput" : 285.20463112547117,
    "receivedKBytesPerSec" : 2738.6886111882404,
    "sentKBytesPerSec" : 72.69375851928514
  },
  "A2 - POST /jobs/get" : {
    "transaction" : "A2 - POST /jobs/get",
    "sampleCount" : 14966,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 81.40264599759404,
    "medianResTime" : 78.0,
    "minResTime" : 0.0,
    "maxResTime" : 290.0,
    "pct1ResTime" : 130.0,
    "pct2ResTime" : 154.0,
    "pct3ResTime" : 199.32999999999993,
    "throughput" : 251.96558748758358,
    "receivedKBytesPerSec" : 222.39577085648267,
    "sentKBytesPerSec" : 62.99139687189589
  },
  "B1 - POST /events/ingest" : {
    "transaction" : "B1 - POST /events/ingest",
    "sampleCount" : 17001,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 34.45697311922824,
    "medianResTime" : 24.0,
    "minResTime" : 2.0,
    "maxResTime" : 289.0,
    "pct1ResTime" : 79.0,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 162.0,
    "throughput" : 285.4432505036937,
    "receivedKBytesPerSec" : 50.454324551922426,
    "sentKBytesPerSec" : 149.96920778416722
  }
}